Autodesk.Revit.DB.FabricationPartType.ResetAssemblyTypes(Autodesk.Revit.DB.Document)
Resets the assembly types of all assembly instances with one or more FabricationPart element.
The document where the assemblies with FabricationPart will be reset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.2